"""
Выведите на экран при помощи print() результат работы
"""
print(float('1'))   # 1.0
print(int('2.5'))   # ValueError
print(bool(1))      # True
print(bool(''))     # False
print(bool(0))      # False
